#Pandas is a library built on top of numpy, its used for data cleaning and preparation. Its also used for performance and productivity, pandas can work with data from a wide variety of sources and has built in visialization features.

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a', 'b', 'c']
data = [10, 20, 30]
arr = np.array(data)
d = {'a':10, 'b':20, 'c':30}

In [4]:
pd.Series(data=data) #making a series from data

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=data, index=labels) #making a series with custom index

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(d) #series from a dict

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr, labels) #series with a nparray

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(data=labels) #woah, it can hold any type of data

0    a
1    b
2    c
dtype: object

In [11]:
serOne = pd.Series([1, 2, 3, 4], ["USA", "Germany", "USSR", "Japan"])
serOne #a series

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
serTwo = pd.Series([1, 2, 5, 4], ["USA", "Germany", "Italy", "Japan"])
serTwo #another series

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [13]:
serOne["USA"] #indexing a series

1

In [14]:
print(serOne + serTwo) #trying to add two series

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

#DataFrames in Pandas

In [15]:
from numpy.random import randn
np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df #making a dataframe

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [20]:
print(df['W']) #slicing a dataframe
type(df['W'] )

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

pandas.core.series.Series

In [21]:
df.W #another way of selecting a column

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [22]:
df[['W', 'Z']] #to select multiple columns

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [28]:
df['V'] = df['Y'] + df['Z'] #creating a new column
df

          W         X         Y         Z         V
A  0.302665  1.693723 -1.706086 -1.159119 -2.865205
B -0.134841  0.390528  0.166905  0.184502  0.351406
C  0.807706  0.072960  0.638787  0.329646  0.968433
D -0.497104 -0.754070 -0.943406  0.484752 -0.458655
E -0.116773  1.901755  0.238127  1.996652  2.234779

In [29]:
df.drop('V', axis=1) #dropping a column

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
df #but the change isn't permanant

          W         X         Y         Z         V
A  0.302665  1.693723 -1.706086 -1.159119 -2.865205
B -0.134841  0.390528  0.166905  0.184502  0.351406
C  0.807706  0.072960  0.638787  0.329646  0.968433
D -0.497104 -0.754070 -0.943406  0.484752 -0.458655
E -0.116773  1.901755  0.238127  1.996652  2.234779

In [31]:
df.drop('V', axis=1, inplace=True) #set inplace as True to make changes
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [32]:
df.drop('E', axis=0) #dropping a row

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [33]:
df.loc['A'] #selecting rows

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [34]:
df.iloc[2] #another way of selecting rows, using index

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [35]:
df.loc['B', 'Y'] #getting a value from row B and col Y

0.16690463609281317

In [36]:
df.loc[['A', 'B'],['W', 'Y']] #we can even select multiple rows & cols

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [37]:
df > 0 #conditional selection

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [38]:
booldf = df > 0
df[booldf] #same as df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [40]:
print(df['W']>0)
df['W'] #comparing side by side

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [41]:
df[df['Z']<0] #returns the only row where the value of Z is less than 0

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [42]:
df[df['W']>0]['X'] #combining the conditions to select a column

A    1.693723
C    0.072960
Name: X, dtype: float64

In [43]:
df[(df['W']>0) & (df['X']>0)] #& works and and dosen't for multiple conditions

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [44]:
df[(df['W']>0) | (df['X']>0)] #| works and or dosen't for multiple conditions

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [45]:
df.reset_index() #to reset the index, set inplace to confirm

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [46]:
newIndex = 'CA NY WY OR CO'.split() #creating a new list for index

In [47]:
df['States'] = newIndex
df #setting a new column

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [48]:
df.set_index('States') #this will overwrite the old index, if you set inplace as true

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [49]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

#Index Levels

In [50]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [52]:
hier_index #creating MultiIndex

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df #Indexception

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [55]:
df.loc['G1']['A'] #selecting from inside an index

1   -0.993263
2   -1.136645
3    1.025984
Name: A, dtype: float64

In [56]:
df.loc['G1'].loc[1] #selecting from inside an index

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [58]:
df.index.names = ['Groups', 'Nums'] #to rename the index
df

                    A         B
Groups Nums
G1     1    -0.993263  0.196800
       2    -1.136645  0.000366
       3     1.025984 -0.156598
G2     1    -0.031579  0.649826
       2     2.154846 -0.610259
       3    -0.755325 -0.346419

In [66]:
df.loc["G2"].loc[2] #selecting row2 from G2

A    2.154846
B   -0.610259
Name: 2, dtype: float64

In [68]:
df.xs('G1') #using cross section to get the group1

             A         B
Nums
1    -0.993263  0.196800
2    -1.136645  0.000366
3     1.025984 -0.156598

In [ ]:
df.xs(1, level="Num") #using cross section with level

#Missing Data

In [71]:
df = {'A': [1,2,np.nan],'B': [5, np.nan, np.nan],'C': [1, 2, 3]}
df = pd.DataFrame(df) #a dataframe with missing values
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [72]:
df.dropna() #will drop the whole row, even if a single nan value

     A    B  C
0  1.0  5.0  1

In [73]:
df.dropna(axis=1) #will drop the whole col, even if a single nan value

   C
0  1
1  2
2  3

In [74]:
df.dropna(thresh=2) #will drop the whole row, with a threshold of 2 nans

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [75]:
df.fillna(value='Filled') #fill the NaN values

        A       B  C
0     1.0     5.0  1
1     2.0  Filled  2
2  Filled  Filled  3

In [78]:
df["A"].fillna(value=df["A"].mean()) #filling the NaN value with mean values
df["B"].fillna(value=df["B"].mean())
df["C"].fillna(value=df["C"].mean())

0    1
1    2
2    3
Name: C, dtype: int64

In [80]:
data = {"Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
        "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
        "Sales": [200, 120, 340, 124, 243, 350]}
df = pd.DataFrame(data)
df #creating a new dataframe

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [82]:
byComp = df.groupby("Company") #grouping by company
byComp.mean() #taking mean

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [83]:
byComp.sum() #taking sum

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [84]:
byComp.std() #taking standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [85]:
df.groupby("Company").sum() #a oneliner

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [86]:
df.groupby("Company").count() #getting a count

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [88]:
df.groupby("Company").describe().transpose() #describes the company column

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

#Operations on a dataframe

In [89]:
df = pd.DataFrame({"col1": [1, 2, 3, 4],
                    "col2":[444, 555, 666, 444],
                    "col3": ["abc", "def", "ghi", "xyz"]})
df #a new df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [90]:
df.head() #view the first five rows

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [91]:
df["col2"].unique() #returns the unique values in col2

array([444, 555, 666], dtype=int64)

In [92]:
df.nunique() #number of unique values

col1    4
col2    3
col3    4
dtype: int64

In [94]:
df["col2"].value_counts() #retuens the number of times a value is repeated

444    2
555    1
666    1
Name: col2, dtype: int64

In [97]:
df[(df["col1"]>2)&(df["col2"]==444)] #conditional statement

   col1  col2 col3
3     4   444  xyz

In [99]:
def times2(x):
    return x*2

df["col1"].apply(times2) #applying a custom functions

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [105]:
df["col4"]= df["col1"].apply(lambda x: x*2) #apply with lambda functions
df

   col1  col2 col3  col4
0     1   444  abc     2
1     2   555  def     4
2     3   666  ghi     6
3     4   444  xyz     8

In [106]:
df.drop("col4", axis=1, inplace=True) #to drop a column
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [107]:
df.columns #will return a list of column indexes

Index(['col1', 'col2', 'col3'], dtype='object')

In [109]:
df.index #will return a list of indexes

RangeIndex(start=0, stop=4, step=1)

In [110]:
df.sort_values(by="col2") #to sort by a column

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [113]:
df.isnull() #to check for null values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [114]:
pwd #gives you the current working dir

'c:\\Users\\yeshw\\Desktop\\DataScience & MachineLearning'

In [119]:
df = pd.read_csv("example.csv")
df #reading a csv file

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [120]:
df = pd.read_csv("example.csv")
df.to_csv("resExample", index=False) #saving an output

In [123]:
df = pd.read_excel("Excel_Sample.xlsx", sheet_name="Sheet1")
df #we can even read excel files

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

#Working on Salaries dataset

In [4]:
import pandas as pd

In [5]:
sal = pd.read_csv("Salaries.csv")
sal #reading salaries as a dataframe called sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [6]:
sal.head() #reading the head of sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [7]:
sal.info() #finding the total number of entries

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [8]:
sal["BasePay"].mean() #average basepay

66325.44884050643

In [10]:
sal["OvertimePay"].max() #highest amount of OvertimePay in the dataset

245131.88

In [18]:
sal[sal["EmployeeName"] == "JOSEPH DRISCOLL"][["JobTitle"]] #find job title of Joseph Driscoll

                     JobTitle
24  CAPTAIN, FIRE SUPPRESSION

In [19]:
sal[sal["EmployeeName"] == "JOSEPH DRISCOLL"][["TotalPay"]] #find total pay of Joseph Driscoll

     TotalPay
24  270324.91

In [31]:
sal.loc[sal["TotalPayBenefits"].idxmax()]["EmployeeName"] #name of highest paid employee
#sal[sal["TotalPayBenefits"] == sal["TotalPayBenefits"].max()]["EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [34]:
sal.loc[sal["TotalPayBenefits"].idxmin()] #name of lowest paid employee
#sal[sal["TotalPayBenefits"] == sal["TotalPayBenefits"].min()]["EmployeeName"]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                   0.0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                     NaN
Name: 148653, dtype: object

In [36]:
sal.groupby("Year").mean()["BasePay"] #average basepay of all employees per year 11'-14'

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [39]:
sal["JobTitle"].nunique() #no of unique jobtitles

2159

In [44]:
sal["JobTitle"].value_counts().head(5) #top 5 most common jobs

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [60]:
sum(sal[sal["Year"] == 2013]["JobTitle"].value_counts() == 1) #num of Jobtitles represented by one person in 2013

202

In [80]:
def checkChief(x):
    return True if "chief" in x.lower().split() else False
sal["JobTitle"].apply(checkChief).sum() #how many people have Chief in their job title

477

In [82]:
sal["title_len"] = sal["JobTitle"].apply(len)
sal[["TotalPay", "title_len"]].corr()

           TotalPay  title_len
TotalPay   1.000000  -0.015356
title_len -0.015356   1.000000